BlackIoT/Martinica/hardware/BlackIoT/samd/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

# Derived from MKR1000 definition file
# BlackIoT Martinica
# -----------------------
martinica.name=BlackIoT Martinica
martinica.vid.0=0x2341
martinica.pid.0=0x804e
martinica.vid.1=0x2341
martinica.pid.1=0x004e
martinica.vid.2=0x2341
martinica.pid.2=0x824e
martinica.vid.3=0x2341
martinica.pid.3=0x024e
martinica.upload_port.0.vid=0x2341
martinica.upload_port.0.pid=0x804e
martinica.upload_port.1.vid=0x2341
martinica.upload_port.1.pid=0x004e
martinica.upload_port.2.vid=0x2341
martinica.upload_port.2.pid=0x824e
martinica.upload_port.3.vid=0x2341
martinica.upload_port.3.pid=0x024e
martinica.upload_port.4.board=martinica

martinica.upload.tool=arduino:bossac
martinica.upload.tool.default=arduino:bossac
martinica.upload.tool.network=arduino_ota
martinica.upload.protocol=sam-ba
martinica.upload.maximum_size=262144
martinica.upload.maximum_data_size=32768
martinica.upload.use_1200bps_touch=true
martinica.upload.wait_for_upload_port=true
martinica.upload.native_usb=true
martinica.build.mcu=cortex-m0plus
martinica.build.f_cpu=48000000L
martinica.build.usb_product="BlackIoT Martinica"
martinica.build.usb_manufacturer="BlackIoT SAGL"
martinica.build.board=SAMD_MKR1000
martinica.build.core=arduino:arduino
martinica.build.extra_flags=-DUSE_ARDUINO_MKR_PIN_LAYOUT -D__SAMD21J18A__ {build.usb_flags}
martinica.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
martinica.build.openocdscript=openocd_scripts/arduino_zero.cfg
martinica.build.variant=martinica
martinica.build.vid=0x2341
martinica.build.pid=0x804e
martinica.bootloader.tool=arduino:openocd
#martinica.bootloader.tool.default=openocd
#martinica.bootloader.file=martinica/samd21_sam_ba_arduino_mkr1000.bin

#for debugger
#mzero_zero_bl.compiler.c.extra_flags=-DDEBUG
#mzero_zero_bl.compiler.cpp.extra_flags=-DDEBUG
#mzero_zero_bl.compiler.elf2hex.extra_flags=--debugging
